week11/day01/rails-basic-auth/app/controllers/pages_controller.rb

  def home
      @logged_in_user = User.find_by :id => session[:user_id]
---
SELECT "users".* FROM "users" WHERE "users"."id" IS NULL LIMIT $1  [["LIMIT", 1]]